docs/blog/posts/huel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-13 Sun 15:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Huel</title>
<meta name="author" content="Noelle Crawford" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Huel
<br />
<span class="subtitle">"You've gotta tell them! Soylent Green is people! We've gotta stop them somehow!" &#x2013; Soylent Green (1973)</span>
</h1>
<p>
Link: <a href="https://huel.com">https://huel.com</a> 
</p>
<div id="outline-container-org561393b" class="outline-2">
<h2 id="org561393b">What is Huel?</h2>
<div class="outline-text-2" id="text-org561393b">
<p>
Huel (Human Fuel) is a meal replacement company which aims "to make nutritionally complete, convenient, affordable food, with minimal impact on animals and the environment". All Huel products are vegan, and many are gluten free.
The main Huel offering is their meal-powder, which comes in high carb, standard, and high protein varients, and can be mixed with water for an instant meal. However, they're constantly expanding thier product offerings, which now include re-hydratable hot meals (think MREs), protein bars, greens powders, and more.
I do not enjoy cooking, and I also dislike eating out (due to the cost, time commitment, and poor nutrition of restaurant food). Therefore, I was enticed by the idea of a relatively cheap way to eat high protein with <i>no</i> cooking required, and without being worried about nutrient deficiencies. 
</p>
</div>
</div>
<div id="outline-container-org222aa0f" class="outline-2">
<h2 id="org222aa0f">My Experience</h2>
<div class="outline-text-2" id="text-org222aa0f">
<p>
I've been a Hueligan (Huel customer) since 2023, with it making up ~25-100% of my diet at any given point in time.
I find it incredibly convenient, especially when working in the office, where I keep a few bags at my desk and mix up a bottle whenever needed.
Due to the high water and fiber content a bottle of Huel is very filling to drink (I use a higher than recommended ratio of water to power which exasperates this).
</p>

<p>
Of their product line-up, I've tried the powder, the re-hydratable meals (packets and cups), the protein bars, the greens powder, and the energy drinks.
While nice tasting, I don't buy the greens powder or energy drinks regularly since I don't have much of a use case (see <a href="zest_caffine_pills.html">here</a> for how I prefer to consume caffine).
I do keep protein bars on hand and in my bag, but they're more of a "for emergencies" type purchase than something I eat every day. I like the convenience, but wish they were more calorically dense than they are. 
The re-hydrateable meals are great but more expensive and lower in protein than the powder, so I tend to eat them only a few times per week, mostly as a way to satiate any cravings for "real food" when I'm not keeping any groceries at home. 
The high protein (black edition) powder is my go to. I cycle between flavors for variety, but always keep a few bags at home and in the office. In terms of convenience, price, and nutrition, the product is unmatched.
</p>
</div>
<div id="outline-container-org3830843" class="outline-3">
<h3 id="org3830843">How it works with a High Metabolism</h3>
<div class="outline-text-3" id="text-org3830843">
<p>
Huel's nutrient content is designed to be sufficient assuming a 2000 calorie diet. I have a pretty high metabolism and work out a lot, so I need well over 2000 calories a day. 
While Huel is cheaper than many other protein sources for the same calories/macros, it's expensive enough that I'd prefer to fill out the extra calories with something else, and I don't find it worth buying the high carb version.
Luckily 2000 calories of Huel black powder is already 200g of protein (more than enough), so I consume cheap energy sources such as rice, oatmeal, and/or peanut butter to up my caloric intake cheaply.
I've also found Huel to be much to low in electrolytes and low in creatine compared to a standard diet, which I use supplements to correct.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcc4c5b2" class="outline-2">
<h2 id="orgcc4c5b2">Discussion</h2>
<div class="outline-text-2" id="text-orgcc4c5b2">
<p>
One question I always ask when talking about Huel to friends is: "But don't you miss normal food?". I find this to be such an odd question, because most people don't eat "real" food for every meal. People snack, they eat ramen and fast-food, they skip meals entirely, or they have a protein bar. Huel is meant to replace these instances, and make it easier to get a nutritious meal when you don't have the time or willpower to cook. If you miss normal food, then eat normal food. For me, I find that going out to eat once in a while can be enough to satisfy my craving for "real" food. More recently, I've been cooking a bit on the weekends as well. But during the week when I don't <i>want</i> to think about food, Huel is an invaluable tool for keeping myself healthy.
</p>

<p>
Many people seem afraid they will somehow lost the ability to digest normal food they drink too much Huel, or that it's not actually healthy. Luckily, the Huel website is very open about nutritional information, ingredients, and testing. They provided data and studies showing that Huel is good for you: participants consuming only Huel saw health improvements. The protein <i>does</i> get absorbed at a similar rate to protein from meat sources. All essential amino acids are present in a healthy ratio (etc, etc). 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noelle Crawford</p>
<p class="date">Created: 2025-07-13 Sun 15:18</p>
</div>
</body>
</html>
